>    as I assume that the server on which the image is located is also the one on which you want to deploy it?

No, it is not.

I updated to 0.1.4 and still have the error.

```shell
benpro on chiisai in ~/Devel/incus via 💠 default took 11s569ms 
at 05:25:11 ❯ tofu apply
incus_storage_pool.default: Refreshing state... [name=default]
incus_storage_volume.forgejo_var_lib_forgejo: Refreshing state... [name=forgejo_var_lib_forgejo]
incus_storage_volume.laminar_var_lib_incus: Refreshing state... [name=laminar_var_lib_incus]
incus_storage_volume.laminar_var_lib_laminar: Refreshing state... [name=laminar_var_lib_laminar]
incus_instance.laminar: Refreshing state... [name=laminar]

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # incus_instance.forgejo will be created
  + resource "incus_instance" "forgejo" {
      + config           = {}
      + ephemeral        = false
      + image            = "laminar.incus:forgejo-8.0.1-1benoitjpnet"
      + ipv4_address     = (known after apply)
      + ipv6_address     = (known after apply)
      + limits           = {}
      + mac_address      = (known after apply)
      + name             = "forgejo"
      + profiles         = [
          + "default",
        ]
      + running          = true
      + status           = (known after apply)
      + target           = (known after apply)
      + type             = "container"
      + wait_for_network = true

      + device {
          + name       = "var_lib_forgejo"
          + properties = {
              + "path"   = "/var/lib/forgejo"
              + "pool"   = "default"
              + "source" = "forgejo_var_lib_forgejo"
            }
          + type       = "disk"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  OpenTofu will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

incus_instance.forgejo: Creating...
╷
│ Error: Failed to retrieve Incus ImageServer
│ 
│   with incus_instance.forgejo,
│   on forgejo.tf line 6, in resource "incus_instance" "forgejo":
│    6: resource "incus_instance" "forgejo" {
│ 
│ The remote isn't a private server
╵

benpro on chiisai in ~/Devel/incus via 💠 default took 2s264ms 
at 05:25:14 ❌1 ❯ incus remote ls
+---------------------------+------------------------------------+---------------+-------------+--------+--------+--------+
|           NAME            |                URL                 |   PROTOCOL    |  AUTH TYPE  | PUBLIC | STATIC | GLOBAL |
+---------------------------+------------------------------------+---------------+-------------+--------+--------+--------+
| docker                    | https://registry-1.docker.io/v2    | oci           | none        | YES    | NO     | NO     |
+---------------------------+------------------------------------+---------------+-------------+--------+--------+--------+
| images                    | https://images.linuxcontainers.org | simplestreams | none        | YES    | NO     | NO     |
+---------------------------+------------------------------------+---------------+-------------+--------+--------+--------+
| incus.home.arpa (current) | https://incus.home.arpa:8443       | incus         | tls         | NO     | NO     | NO     |
+---------------------------+------------------------------------+---------------+-------------+--------+--------+--------+
| laminar.incus             | https://laminar.incus:8443         | incus         | tls         | YES    | NO     | NO     |
+---------------------------+------------------------------------+---------------+-------------+--------+--------+--------+
| local                     | unix://                            | incus         | file access | NO     | YES    | NO     |
+---------------------------+------------------------------------+---------------+-------------+--------+--------+--------+

```